# ChangeSection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExtElemChangeBeamSection..::..ChangeSection Method
IExtElemChangeBeamSection Interface See Also
---
The method that will be called when user wants to change beam section
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
bool ChangeSection(
	Document doc,
	ElementId idElem
)
```

Visual Basic
---
```text
Function ChangeSection ( _
	doc As Document, _
	idElem As ElementId _
) As Boolean
```

Visual C++
---
```text
bool ChangeSection(
	Document^ doc,
	ElementId^ idElem
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document Revit document
idElem
    Type: Autodesk.Revit.DB..::..ElementId id of the selected element
# ### Return Value
Indicates whether the operation succeeded or not
# See Also
IExtElemChangeBeamSection Interface
Autodesk.Revit.DB.Structure Namespace